#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ДобавитьТестовыйНабор("Обнуление остатков движений прихода и расхода").ВТранзакции()
		.ДобавитьТест("ОбнулениеОстатковВзаиморасчеты", "Обнуление остатков по регистру ""Взаиморасчеты""")
		.ДобавитьТест("ОбнулениеОстатковТоварныеЗапасы", "Обнуление остатков по регистру ""Товарные запасы""")
		;
	
КонецПроцедуры

Процедура ОбнулениеОстатковВзаиморасчеты () Экспорт
	
	МассивДокументов = МассивДокументовПриходаРасхода();
	
	// Собираем обороты по всем документам и сравниваем суммы прихода и расхода
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.Взаиморасчеты.Обороты(, , Регистратор, )";
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Регистратор");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("СуммаОборот");
	ОписаниеЗапроса.Условия.Добавить("Регистратор В(&Документы)");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Документы", МассивДокументов);
	
	ТаблицаДвижений = ЮТЗапросы.РезультатЗапроса(ОписаниеЗапроса);
	Расхождения = ТаблицаДвижений.Итог("СуммаОборот");
	
	ЮТест.ОжидаетЧто(Расхождения)
		.Равно(0);
	
КонецПроцедуры

Процедура ОбнулениеОстатковТоварныеЗапасы() Экспорт
	
	МассивДокументов = МассивДокументовПриходаРасхода();
	
	// Собираем обороты по всем документам и сравниваем суммы прихода и расхода
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.ТоварныеЗапасы.Обороты(, , Регистратор, )";
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Регистратор");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("КоличествоОборот");
	ОписаниеЗапроса.Условия.Добавить("Регистратор В(&Документы)");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Документы", МассивДокументов);
	
	ТаблицаДвижений = ЮТЗапросы.РезультатЗапроса(ОписаниеЗапроса);
	Расхождения = ТаблицаДвижений.Итог("КоличествоОборот");
	
	ЮТест.ОжидаетЧто(Расхождения)
		.Равно(0);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МассивДокументовПриходаРасхода()

	Поставщик = ЮТест.Данные().КонструкторОбъекта("Справочники.Контрагенты")
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовый поставщик")
		.Записать();
		
	Покупатель = ЮТест.Данные().КонструкторОбъекта("Справочники.Контрагенты")
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовый покупатель")
		.Записать();
	
	Товар = ЮТест.Данные().КонструкторОбъекта("Справочники.Товары")
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовый товар")
		.Записать();
	
	Товар2 = ЮТест.Данные().КонструкторОбъекта("Справочники.Товары")
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовый товар 2")
		.Записать();
	
	Склад = ЮТест.Данные().КонструкторОбъекта("Справочники.Склады")
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовый склад")
		.Записать();
		
	Валюта = ЮТест.Данные().КонструкторОбъекта("Справочники.Валюты")
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовая валюта")
		.Записать();
		
	Организация = ЮТест.Данные().КонструкторОбъекта("Справочники.Организации")
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовая организация")
		.Записать();
	
	ДокументПрихода = ЮТест.Данные().КонструкторОбъекта("Документы.ПриходТовара")
		.ФикцияОбязательныхПолей()
		.Установить("Поставщик", Поставщик)
		.Установить("Склад", Склад)
		.Установить("Валюта", Валюта)
		.Установить("Организация", Организация)
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку()
				.Установить("Товар", Товар)
				.Установить("Цена", 100)
				.Установить("Количество", 4)
				.Установить("Сумма", 400)
			.ДобавитьСтроку()
				.Установить("Товар", Товар2)
				.Установить("Цена", 200)
				.Установить("Количество", 3)
				.Установить("Сумма", 600)
		.Провести()
		;
	
	ДокументПрихода2 = ЮТест.Данные().КонструкторОбъекта("Документы.ПриходТовара")
		.ФикцияОбязательныхПолей()
		.Установить("Поставщик", Поставщик)
		.Установить("Склад", Склад)
		.Установить("Валюта", Валюта)
		.Установить("Организация", Организация)
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку()
				.Установить("Товар", Товар)
				.Установить("Цена", 100)
				.Установить("Количество", 6)
				.Установить("Сумма", 600)
			.ДобавитьСтроку()
				.Установить("Товар", Товар2)
				.Установить("Цена", 200)
				.Установить("Количество", 2)
				.Установить("Сумма", 400)
				
		.Провести()
		;
	
		ДокументРасхода = ЮТест.Данные().КонструкторОбъекта("Документы.РасходТовара")
		.ФикцияОбязательныхПолей()
		.Установить("Покупатель", Покупатель)
		.Установить("Склад", Склад)
		.Установить("Валюта", Валюта)
		.Установить("Организация", Организация)
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку()
				.Установить("Товар", Товар)
				.Установить("Цена", 100)
				.Установить("Количество", 10)
				.Установить("Сумма", 1000)
			.ДобавитьСтроку()
				.Установить("Товар", Товар2)
				.Установить("Цена", 200)
				.Установить("Количество", 5)
				.Установить("Сумма", 1000)
		.Провести()
		;
	
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(ДокументПрихода);
	МассивДокументов.Добавить(ДокументПрихода2);
	МассивДокументов.Добавить(ДокументРасхода);
	
	Возврат МассивДокументов;

КонецФункции // МассивДокументовПриходаРасхода()

#КонецОбласти