#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ДобавитьТестовыйНабор("Проверка документа ""Приход товара""", "Документы").ВТранзакции()
		.ДобавитьТест("ПроверкаЗаписи", "Проверка записи")
		.ДобавитьТест("ПроверкаПроведения", "Проверка проведения")
		.ДобавитьТест("ПроверкаДвиженийВзаиморасчеты", "Проверка наличия движений по регистру ""Взаиморасчеты""")
		.ДобавитьТест("ПроверкаДвиженийТоварныеЗапасы", "Проверка наличия движений по регистру ""Товарные запасы""")
	
КонецПроцедуры

Процедура ПроверкаЗаписи() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	
	// 2. Выполнение функции.
	ДокументОбъект = СлучайныйДокумент();
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(ДокументОбъект)
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Запись)
		.НеВыбрасываетИсключение();
	
КонецПроцедуры

Процедура ПроверкаПроведения() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	
	// 2. Выполнение функции.
	ДокументОбъект = СлучайныйДокумент();
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(ДокументОбъект)
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение)
		.НеВыбрасываетИсключение();
	
КонецПроцедуры

Процедура ПроверкаДвиженийВзаиморасчеты() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	
	// 2. Выполнение функции.
	ДокументОбъект = НовыйДокумент();
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	// 3. Проверка результата.
	Движения = ЮТЗапросы.ДвиженияДокумента(ДокументОбъект.Ссылка, "Взаиморасчеты");
	
	ЮТест.ОжидаетЧто(Движения)
		.Заполнено();
	
	Для Каждого Строка Из Движения Цикл
		ЮТест.ОжидаетЧто(Строка.Контрагент)
			.Равно(ДокументОбъект.Поставщик);
		
		ЮТест.ОжидаетЧто(Строка.Валюта)
			.Равно(ДокументОбъект.Валюта);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаДвиженийТоварныеЗапасы() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	
	// 2. Выполнение функции.
	ДокументОбъект = НовыйДокумент();
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	// 3. Проверка результата.
	Движения = ЮТЗапросы.ДвиженияДокумента(ДокументОбъект.Ссылка, "ТоварныеЗапасы");
	ЮТест.ОжидаетЧто(Движения)
		.Заполнено();
	
	Для Каждого Строка Из Движения Цикл
		ЮТест.ОжидаетЧто(Строка.Склад)
			.Равно(ДокументОбъект.Склад);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйДокумент()
	
	Организация = ЮТест.Данные().КонструкторОбъекта("Справочники.Организации")
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовая организация")
		.Записать();
	
	Контрагент = ЮТест.Данные().КонструкторОбъекта("Справочники.Контрагенты")
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовый поставщик")
		.Записать();
	
	Склад = ЮТест.Данные().КонструкторОбъекта("Справочники.Склады")
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовый склад")
		.Записать();
		
	Товар = ЮТест.Данные().КонструкторОбъекта("Справочники.Товары")
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовый товар")
		.Записать();
	
	Валюта = ЮТест.Данные().КонструкторОбъекта("Справочники.Валюты")
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тестовая валюта")
		.Записать();
	
	Документ = ЮТест.Данные().КонструкторОбъекта("Документы.ПриходТовара")
		.ФикцияОбязательныхПолей()
		.Установить("Поставщик", Контрагент)
		.Установить("Склад", Склад)
		.Установить("Валюта", Валюта)
		.Установить("Организация", Организация)
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку()
			.Установить("Товар", Товар)
			.Установить("Цена", 100)
			.Установить("Количество", 5)
			.Установить("Сумма", 500)
		.НовыйОбъект()
		;
		
	Возврат Документ;
	
КонецФункции // НовыйДокумент()

Функция СлучайныйДокумент()
	
	Товар = ЮТест.Данные().КонструкторОбъекта("Справочники.Товары")
		.ФикцияОбязательныхПолей();
	
	Документ = ЮТест.Данные().КонструкторОбъекта("Документы.ПриходТовара")
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку()
			.Установить("Товар", Товар)
			.Установить("Цена", 100)
			.Установить("Количество", 5)
			.Установить("Сумма", 500)
		.НовыйОбъект()
	;
	
	Возврат Документ;
	
КонецФункции // СлучайныйДокумент()

#КонецОбласти